# Appending to DataFrame

In [1]:
import pandas as pd
 
df = pd.DataFrame(columns = ['A','B','C'])

In [2]:
df

Empty DataFrame
Columns: [A, B, C]
Index: []

df.loc --> https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html

to access data by using row/values we use df.loc

In [3]:
df.loc[0,'A'] = 1

In [4]:
df

   A    B    C
0  1  NaN  NaN

In [5]:
df.loc[1] = [2,3,4]
df

   A    B    C
0  1  NaN  NaN
1  2    3    4

In [6]:
df.loc[2] = {'A':3, 'C':9, 'B':9}
df

   A    B    C
0  1  NaN  NaN
1  2    3    4
2  3    9    9

The first input in .loc[] is the index. If you use an existing index, you will overwrite the values in that
row:

In [7]:
df.loc[1] = [5, 6, 7]
df

   A    B    C
0  1  NaN  NaN
1  5    6    7
2  3    9    9

In [10]:
df.loc[0, 'B'] = 8
df

   A  B    C
0  1  8  NaN
1  5  6    7
2  3  9    9

### Adding a dataframe to another

In [11]:
df1 = pd.DataFrame([['a1','b1'],['a2','b2']],columns=['A','B'])
df1

    A   B
0  a1  b1
1  a2  b2

In [12]:
df2 = pd.DataFrame([['b1','c1'],['b2','c2']],columns=['B','C'])
df2

    B   C
0  b1  c1
1  b2  c2

The two DataFrames are not required to have the same set of columns. The append method does
not change either of the original DataFrames. Instead, it returns a new DataFrame by appending
the original two. Appending a DataFrame to another one is quite simple:

In [14]:
df1.append(df2)

     A   B    C
0   a1  b1  NaN
1   a2  b2  NaN
0  NaN  b1   c1
1  NaN  b2   c2

As you can see, it is possible to have duplicate indices (0 in this example). To avoid this issue, you
may ask Pandas to reindex the new DataFrame for you:

In [13]:
df1.append(df2,ignore_index=True)

     A   B    C
0   a1  b1  NaN
1   a2  b2  NaN
2  NaN  b1   c1
3  NaN  b2   c2